WINDOWS:
analytic-signal.preview-pdf
andyyaldoo.vscode-json
codezombiech.gitignore
docsmsft.docs-article-templates 
docsmsft.docs-markdown
docsmsft.docs-preview
donjayamanne.githistory
esbenp.prettier-vscode
felipecaputo.git-project-manager
formulahendry.docker-explorer   
foxundermoon.shell-format       
hediet.vscode-drawio
mhutchie.git-graph
ms-azuretools.vscode-docker     
ms-dotnettools.csharp
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-vscode.cpptools
p1c2u.docker-compose
redhat.vscode-yaml
shd101wyy.markdown-preview-enhanced
VisualStudioExptTeam.vscodeintellicode
yzane.markdown-pdf
yzhang.markdown-all-in-one

WSL:
Extensions installed on WSL: Ubuntu-20.04:
analytic-signal.preview-pdf
andyyaldoo.vscode-json
codezombiech.gitignore
docsmsft.docs-article-templates
docsmsft.docs-markdown
docsmsft.docs-preview
donjayamanne.githistory
esbenp.prettier-vscode
felipecaputo.git-project-manager
formulahendry.docker-explorer
foxundermoon.shell-format
hediet.vscode-drawio
mhutchie.git-graph
ms-azuretools.vscode-docker
ms-dotnettools.csharp
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-vscode.cpptools
p1c2u.docker-compose
redhat.vscode-yaml
shd101wyy.markdown-preview-enhanced
VisualStudioExptTeam.vscodeintellicode
yzane.markdown-pdf
yzhang.markdown-all-in-one